In [1]:
import pandas as pd
from polyfuzz import PolyFuzz

In [2]:
df = pd.read_excel('clean_products_export.xlsx', dtype=str)
df.head()

                                               name  ...        barcode
0  ABA TANQUE NXR 09/12 PTO INJ 09/12 WEST 357090.0  ...              0
1   ABA TANQUE NXR 09/12 VRM CAUCAIA 09/10 357107.0  ...              0
2               ABA TANQUE NXR 150 13/14 PTO 210629  ...  7899988705907
3                 ABA TANQUE NXR 150 14 VERM 210631  ...  7899988705945
4                           ABA TANQUE PHOENIX  JET  ...              0

[5 rows x 6 columns]

In [5]:
df['name'] = df['name'].str.normalize('NFKD').str.encode('ascii', errors='ignore').str.decode('utf-8')
df.head()

                                               name  ...        barcode
0  ABA TANQUE NXR 09/12 PTO INJ 09/12 WEST 357090.0  ...              0
1   ABA TANQUE NXR 09/12 VRM CAUCAIA 09/10 357107.0  ...              0
2               ABA TANQUE NXR 150 13/14 PTO 210629  ...  7899988705907
3                 ABA TANQUE NXR 150 14 VERM 210631  ...  7899988705945
4                           ABA TANQUE PHOENIX  JET  ...              0

[5 rows x 6 columns]

In [17]:
unique_names = df['name'].unique().tolist()

model = PolyFuzz('TF-IDF')
model.match(unique_names, unique_names)

df_matches = model.get_matches()

suggestions = df_matches[(df_matches['Similarity'] > 0.2) & (df_matches['Similarity'] < 1.00)]
suggestions = suggestions.sort_values(by='Similarity', ascending=False)
suggestions.head()

Empty DataFrame
Columns: [From, To, Similarity]
Index: []